# Terraform environment tt02
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
Acquiring state lock. This may take a few moments...
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.aks_federation["https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/d118512b-ed4c-4387-8ef5-c893a1e7b788/"] will be created
  + resource "azurerm_federated_identity_credential" "aks_federation" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/d118512b-ed4c-4387-8ef5-c893a1e7b788/"
      + name                = "Aks"
      + parent_id           = (known after apply)
      + resource_group_name = "rgaltinnauthauthorization001tt02"
      + subject             = "system:serviceaccount:default:altinn-authorization"
    }

  # azurerm_resource_group.authorization will be created
  + resource "azurerm_resource_group" "authorization" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "rgaltinnauthauthorization001tt02"
      + tags     = (known after apply)
    }

  # azurerm_user_assigned_identity.authorization will be created
  + resource "azurerm_user_assigned_identity" "authorization" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "mialtinnauthauthorization001tt02"
      + principal_id        = (known after apply)
      + resource_group_name = "rgaltinnauthauthorization001tt02"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # static_data.static will be created
  + resource "static_data" "static" {
      + data   = {
          + "created_at" = "Tuesday, 02-Jan-18 23:12:01 UTC"
        }
      + id     = (known after apply)
      + output = (known after apply)
    }

  # module.rbac.azurerm_role_assignment.use_app_configuration[0] will be created
  + resource "azurerm_role_assignment" "use_app_configuration" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Reader"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Authorization/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/tt02/altinn.authorization.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_tt02_altinn.authorization.tfstate.tfplan`